In [1]:
import pandas as pd
import numpy as np
import math as math

In [10]:
df1=pd.DataFrame([['Madison AV','LARCENY/THEFT'],['Central Park','PROSTITUTION'],['Madison AV','PROSTITUTION'],['Madison AV','LARCENY/THEFT'],
                 ['Central Park','GAMBLING'],['5th Avenue','GAMBLING'],['5th Avenue','GAMBLING']])
df1.columns = ['Address','Category']
df1['Address']=df1['Address'].astype('category')
df1

        Address       Category
0    Madison AV  LARCENY/THEFT
1  Central Park   PROSTITUTION
2    Madison AV   PROSTITUTION
3    Madison AV  LARCENY/THEFT
4  Central Park       GAMBLING
5    5th Avenue       GAMBLING
6    5th Avenue       GAMBLING

In [144]:
addresses=sorted(df1["Address"].unique())
categories=sorted(df1["Category"].unique())
C_counts=df1.groupby(["Category"]).size()
A_C_counts=df1.groupby(["Address","Category"]).size()
A_counts=df1.groupby(["Address"]).size()

In [145]:
A_counts=df1.groupby(["Address"]).size()
A_counts=pd.DataFrame(A_counts)
A_counts.columns=['count']
A_counts

              count
Address
5th Avenue        2
Central Park      2
Madison AV        3

In [146]:
df3=pd.merge(df1,A_counts,left_on='Address',how='left',right_index=True)
df3['one']=1
df3

        Address       Category  count  one
0    Madison AV  LARCENY/THEFT      3    1
1  Central Park   PROSTITUTION      2    1
2    Madison AV   PROSTITUTION      3    1
3    Madison AV  LARCENY/THEFT      3    1
4  Central Park       GAMBLING      2    1
5    5th Avenue       GAMBLING      2    1
6    5th Avenue       GAMBLING      2    1

In [153]:
table = pd.pivot_table(df3, values='one',index=['Address'],
                 columns=['Category'], fill_value=0, aggfunc=np.sum)
Total=table.sum(axis=1)

def myfun(v):
    w=v.astype(float)
    return(np.divide(w,Total))
table=table.apply(myfun)
table

Category      GAMBLING  LARCENY/THEFT  PROSTITUTION
Address
5th Avenue         1.0       0.000000      0.000000
Central Park       0.5       0.000000      0.500000
Madison AV         0.0       0.666667      0.333333

In [148]:
df4=pd.merge(df3,table,left_on='Address',how='left',right_index=True).drop(['one'],axis=1)
df4

        Address       Category  count  GAMBLING  LARCENY/THEFT  PROSTITUTION
0    Madison AV  LARCENY/THEFT      3       0.0       0.666667      0.333333
1  Central Park   PROSTITUTION      2       0.5       0.000000      0.500000
2    Madison AV   PROSTITUTION      3       0.0       0.666667      0.333333
3    Madison AV  LARCENY/THEFT      3       0.0       0.666667      0.333333
4  Central Park       GAMBLING      2       0.5       0.000000      0.500000
5    5th Avenue       GAMBLING      2       1.0       0.000000      0.000000
6    5th Avenue       GAMBLING      2       1.0       0.000000      0.000000

In [154]:
table.loc['Default',:]= C_counts/7

In [155]:
table

Category      GAMBLING  LARCENY/THEFT  PROSTITUTION
Address
5th Avenue    1.000000       0.000000      0.000000
Central Park  0.500000       0.000000      0.500000
Madison AV    0.000000       0.666667      0.333333
Default       0.428571       0.285714      0.285714

In [152]:
C_counts

Category
GAMBLING         3
LARCENY/THEFT    2
PROSTITUTION     2
dtype: int64

In [151]:
type(C_counts)

pandas.core.series.Series

In [140]:
C_counts = C_counts/7

In [141]:
C_counts

Category
GAMBLING         0.428571
LARCENY/THEFT    0.285714
PROSTITUTION     0.285714
dtype: float64